Merge pull request 'dev' (#12) from dev into main
Reviewed-on: http://192.168.3.100:53000/vaycent/sw-superpower/pulls/12
